3B/CS486/15-Planning-with-Uncertainty-Decision-Networks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-27 Wed 10:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Planning With Uncertainty Decision Networks</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Planning With Uncertainty Decision Networks</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf53b92a">1. Preferences</a>
<ul>
<li><a href="#orga07f3be">1.1. Properties of Preferences</a></li>
</ul>
</li>
<li><a href="#org973d30a">2. Rationality and Irrationality</a></li>
<li><a href="#org7b26bbd">3. Decisions</a></li>
<li><a href="#orgd6b7ecb">4. Decision Networks</a></li>
<li><a href="#orgb69c348">5. Sequential Decisions</a></li>
<li><a href="#orgd07a0ee">6. Policies</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf53b92a" class="outline-2">
<h2 id="orgf53b92a"><span class="section-number-2">1.</span> Preferences</h2>
<div class="outline-text-2" id="text-1">
<p>
Let \(V(x)\) be the <b>utility</b> of the situation \(X\).
<b>Bayesian decision making</b> is
\[ \mathbb{E}(V(\text{decision})) = \sum_{\text{outcome}} P(\text{outcome} \mid \text{decision}) V(\text{outcome}) \]
Context can also be added to \(V\) so the utility is the value of the decision in the situation context.
\[ \mathbb{E}(V(\text{decision})) = \sum_{\text{outcome}} P(\text{outcome} \mid \text{decision, context}) V(\text{outcome}) \]
</p>

<p>
Actions result in outcomes and agents have <b>preferences</b> over outcomes.
A decision-theoretic <b>rational</b> agent will do the action that has the best outcome for them.
Agents have to act (even if doing nothing) and compare actions without knowing the
outcomes of actions.
</p>

<p>
If \(o_{1}\) and \(o_{2}\) are outcomes
</p>
<ul class="org-ul">
<li><span class="underline">weak preference</span>: \(o_{1} \succeq o_{2}\) means \(o_{1}\) is at least as desirable as \(o_{2}\)</li>
<li><span class="underline">indifference</span>: \(o_{1} \sim o_{2}\) means \(o_{1} \succeq o_{2}\) and \(o_{2} \succeq o_{1}\)</li>
<li><span class="underline">strong preference</span>: \(o_{1} \succ o_{2}\) means \(o_{1} \succeq o_{2}\) and \(o_{2} \not\succeq o_{1}\)</li>
</ul>


<p>
<b>Lottery</b>: probability distribution over outcomes, denoted
\[ [p_{1} : o_{1}, \dots, p_{k} : o_{k}] \]
where \(o_{i}\) are outcomes and \(p_{i} > 0\) such that
\[ \sum_{i} p_{i} = 1 \]
</p>
</div>
<div id="outline-container-orga07f3be" class="outline-3">
<h3 id="orga07f3be"><span class="section-number-3">1.1.</span> Properties of Preferences</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Completeness</b>: agents have to act so they must have preferences
\[ \forall o_{1} \forall o_{2} \; o_{1} \succeq o_{2} \text{ or } o_{2} \succeq o_{1} \]
</p>

<p>
<b>Transitivity</b>: if \(o_{1} \succeq o_{2}\) and \(o_{2} \succeq o_{3}\), then \(o_{1} \succeq o_{3}\)
</p>

<p>
<b>Monotonicity</b>: an agent prefers a larger chance of getting a better outcome than a smaller
chance, so if \(o_{1} \succ o_{2}\) and \(p > q\) then
\[ [p : o_{1}, 1 - p : o_{2}] \succ [q : o_{1}, 1 - q : o_{2}] \]
</p>

<p>
<b>Continuity</b>: suppose \(o_{1} \succ o_{2}\) and \(o_{2} \succ o_{3}\), there then exists a
\(p \in [0,1]\) such that
\[ o_{2} \sim [1 - p : o_{1}, p : o_{3}] \]
</p>

<p>
<b>Decomposibility</b>: an agent is indifferent between lotteries that have same probabilities and
outcomes
</p>

<p>
<b>Substitutability</b>: if \(o_{1} \sim o_{2}\) then the agent is indifferent between lotteries that
only differ by \(o_{1}\) and \(o_{2}\)
</p>

<p>
If preferences follow these properties, they can be measured by the function
\[ \text{utility} : \text{outcome} \to [0,1] \]
such that
</p>
<ul class="org-ul">
<li>\(o_{1} \succeq o_{2}\) if and only if \(\text{utility}(o_{1}) \ge \text{utility}(o_{2})\)</li>
<li>utilities are linear with probabilities
\[ \text{utility}([p_{1} : o_{1}, \dots, p_{k} : o_{k}]) = \sum_{i=1}^{k} p_{i} \times \text{utility}(o_{i}) \]</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org973d30a" class="outline-2">
<h2 id="org973d30a"><span class="section-number-2">2.</span> Rationality and Irrationality</h2>
<div class="outline-text-2" id="text-2">
<p>
Rational agents act to maximize expected utility.
</p>

<p>
Humans are not rational and weight value differently for gains and losses (prospect theory).
</p>
</div>
</div>
<div id="outline-container-org7b26bbd" class="outline-2">
<h2 id="org7b26bbd"><span class="section-number-2">3.</span> Decisions</h2>
<div class="outline-text-2" id="text-3">
<p>
Making a decision on what an agent should do depends on
</p>
<ul class="org-ul">
<li>agent&rsquo;s <b>ability</b>: options available to it</li>
<li>agent&rsquo;s <b>beliefs</b>: how the world could be given the agent&rsquo;s knowledge, updating by sensing
world</li>
<li>agent&rsquo;s <b>preferences</b>: what the agent actually wants and tradeoffs present when
there are risks</li>
</ul>

<p>
Decision theory specifies how to trade off desirability and probabilities of the possible
outcomes for competing actions.
</p>

<p>
<b>Decision variables</b>: random variables that an agent gets to choose the values of, specifically
it can choose any value in the domain
</p>

<p>
<b>Expected utility</b> of a decision leads to outcomes \(\omega\) for utility function \(u\) is
\[ \mathcal{E}(u \mid D = d_{i}) = \sum P(\omega \mid D = d_{i})u(\omega) \]
</p>

<p>
<b>Optimal single decision</b>: decision \(D = d_{\max}\) whose expected utility is maximal:
\[ \mathcal{E}(u \mid D = d_{\max}) = \max_{d_{i} \in \text{dom}(D)} \mathcal{E}(u \mid D = d_{i}) \]
</p>
</div>
</div>
<div id="outline-container-orgd6b7ecb" class="outline-2">
<h2 id="orgd6b7ecb"><span class="section-number-2">4.</span> Decision Networks</h2>
<div class="outline-text-2" id="text-4">
<p>
Graphical representation of a finite sequential decision problem.
Extension of belief networks to include decision variables and utility.
</p>

<p>
A decision network specifies
</p>
<ul class="org-ul">
<li>what info is available when the agent has to act</li>
<li>which variables the utility depends on</li>
</ul>

<p>
A <span class="underline">random variable</span> is drawn as an ellipse, with arcs into the node representing
probabilistic dependence.
A <span class="underline">decision variable</span>  is drawn as a rectangle, with arcs into the node representing info
available when the decision is made.
A <span class="underline">utility node</span> is drawn as a diamond, with arcs into the node representing variables that
the utility depends on.
</p>

<p>
Assume random variables \(X_{1}, \dots, X_{n}\), decision
variables \(D\), and utility dependent on \(X_{i_{1}}, \dots, X_{i_{k}}\) and \(D\):
\[ \mathcal{E}(u \mid D) = \sum_{X_{1}, \dots, X_{n}} \prod_{j=1}^{n} P(X_{j} \mid \text{parents}(X_{j})) \times u(X_{i_{1}}, \dots, X_{i_{k}}, D) \]
where \(\text{parents}(X_{j})\) may include \(D\).
To find the optimal decision:
</p>
<ul class="org-ul">
<li>create a factor for each conditional probability and for the utility</li>
<li>multiply these together and sum out all random variables, creating a factor on \(D\)
that gives the expected utility for each \(D\)</li>
<li>choose the \(D\) with the maximum value in the factor</li>
</ul>
</div>
</div>
<div id="outline-container-orgb69c348" class="outline-2">
<h2 id="orgb69c348"><span class="section-number-2">5.</span> Sequential Decisions</h2>
<div class="outline-text-2" id="text-5">
<p>
An intelligent agent observes and acts iteratively, where subsequent
actions can depend on what is observed, which depends on previous actions.
</p>

<p>
Often an action is carried out to provide info for future actions.
</p>

<p>
<b>Sequential decision problem</b>: consists of a sequence of decision variables
\(D_{1}, \dots, D_{n}\) where each \(D_{i}\) has an info set of variables
\(\text{parents}(D_{i})\) whose value will be known when decision \(D_{i}\)
is made
</p>
</div>
</div>
<div id="outline-container-orgd07a0ee" class="outline-2">
<h2 id="orgd07a0ee"><span class="section-number-2">6.</span> Policies</h2>
<div class="outline-text-2" id="text-6">
<p>
Specifies what an agent should do under each circumstance.
</p>

<p>
A <b>policy</b> is a sequence \(\delta_{1}, \dots, \delta_{n}\) of decision functions
\[ \delta_{i} : \text{dom}(\text{parents}(D_{i})) \to \text{dom}(D_{i}) \]
which means that when the agent has observed \(O \in \text{dom}(\text{parents}(D_{i}))\)
it will do \(\delta_{i}(O)\).
</p>

<p>
A world \(\omega\) satisfies a policy \(\delta\), denoted \(\omega \models \delta\) if the
decisions of the policy are those the world assigns to the decision variables.
</p>

<p>
The <b>expected utility</b> of a policy \(\delta\) is
\[ \mathcal{E} ( u \mid \delta ) = \sum_{\omega \models \delta} u(\omega) \times P(\omega) \]
<b>Optimal policy</b> comes from maximizing expected utility.
</p>

<p>
To find an optimal policy:
</p>
<ol class="org-ol">
<li>create a factor for each conditional probability table and a factor for the utility</li>
<li>set remaining decision nodes to all decision nodes</li>
<li>multiply factors and sum out variables that are not parents of a remaining decision node</li>
<li>select and remove a decision variable \(D\) from the list of remaining decision nodes,
picking one that is in a factor with only itself and some of its parents (no children)</li>
<li>eliminate \(D\) by maximizing, which returns the optimal decision function for \(D\),
\(\text{arg} \max_{D} f\), and a new factor to use \(\max_{D} f\)</li>
<li>repeat steps 3 to 5 until there are no more remaining decision nodes</li>
<li>eliminate the remaining random variables by multiplying th factors, which is the
expected utility of the optimal policy</li>
<li>if any nodes were in evidence, divide by the \(P(\text{evidence})\)</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-11-27 Wed 10:20</p>
</div>
</body>
</html>
